tutorials/blastFoam/triplePointShockInteration/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          ( gas air );

gas
{
    type            basic;
    thermoType
    {
        transport       const;
        thermo          eConst;
        equationOfState idealGas;
    }
    equationOfState
    {
        gamma           1.5;
        a               0;
    }
    specie
    {
        molWeight       28.97;
    }
    transport
    {
        mu              0;
        Pr              1;
    }
    thermodynamics
    {
        Cv              718;
        Hf              0;
    }
    residualRho     1e-06;
    residualAlpha   1e-06;
}

air
{
    type            basic;
    thermoType
    {
        transport       const;
        thermo          eConst;
        equationOfState idealGas;
    }
    equationOfState
    {
        gamma           1.4;
        a               0;
    }
    specie
    {
        molWeight       28.97;
    }
    transport
    {
        mu              0;
        Pr              1;
    }
    thermodynamics
    {
        Cv              718;
        Hf              0;
    }
    residualRho     1e-06;
    residualAlpha   1e-06;
}


// ************************************************************************* //
