tutorials/blastFoam/triplePointShockInteration/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.orig;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    outlet
    {
        type            zeroGradient;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    /*ground
    {
        type            slip;
    }*/

    wedge0
    {
        type            wedge;
    }
    wedge1
    {
        type            wedge;
    }
}


// ************************************************************************* //
