tutorials/blastFoam/triplePointShockInteration/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      HLLC;

ddtSchemes
{
    default         Euler;
    timeIntegrator  RK2SSP;
}

gradSchemes
{
    default         cellMDLimited Gauss linear 1.0;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    // defaultReconstruction quadraticMUSCL Minmod;
    reconstruct(alpha)  quadraticMUSCL Minmod;
    reconstruct(rho)    quadraticMUSCL Minmod;
    reconstruct(U)      quadraticMUSCL Minmod;
    reconstruct(e)      quadraticMUSCL Minmod;
    reconstruct(p)      quadraticMUSCL Minmod;
    reconstruct(speedOfSound) quadraticMUSCL Minmod;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
