tutorials/blastFoam/triplePointShockInteration/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  2.3.0                                 |
  |   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fields (alpha.gas rho.gas);
nBufferLayers 5;

defaultFieldValues
(
    volScalarFieldValue alpha.gas 0
    volScalarFieldValue rho.air 1
    volScalarFieldValue rho.gas 1
    volScalarFieldValue p 0.1
);

regions
(
    boxToCell
    {
        level 3;
        box (-0.1 -0.1 -0.5) (3.1 1 0.5);
        fieldValues
        (
            volScalarFieldValue alpha.gas 1.0
            volScalarFieldValue p 1.0
        );
    }

    boxToCell
    {
        level 3;
        box (1.5 1 -0.5) (3 7 0.5);
        fieldValues
        (
            volScalarFieldValue alpha.gas 1.0
            volScalarFieldValue rho.gas 0.125
        );
    }
);

// ************************************************************************* //
